import React from 'react'

const ECMAScript = () => {
  return (
    <div>
        {/* 
            ECMAScript
            = 자바스크립트 구글 '크롬'이나 마이크로소프트 '에지'같은 '브라우저에서 동작하는 언어'이다
            = 전 세계가 자바스크립트를 사용하고 있기 때문에 마음대로 기능으로 추가해서는 안 되므로 'ECMAScript'라 불리는 자바스크립트 표준
            사양이 정해졌다

            <자바스크립트의 역사>
            = 넷스케이프가 개발
            = '자바'가 큰 인기를 얻었고 그 영향을 받아 1995년에 '자바스크립트'라는 이름으로 명명되었다
            = ECMAScript를 기반으로 함으로써 호환성이 향상되고 현재는 1년에 한 번씩 ECMAScript를 업데이트 한다

            <ECMAScript 명칭>
            = 연도를 붙이는 방법을 사용하는 것이 좋다
            ES6 = ES2015
            ES7 = ES2016

            <근대 자바스크립트 전환기>
            = '근대 자바스크립트 전환기'라고 불릴 만큼 'ECMAScript'가 크게 개정된 버전은 'ES2015(ES6)'이다
            = 2015년에 기능이 대거 추가되며 리액트 등 모던 자바스크립트 개발에 필수라 할 수 있는 문법이나 기능이 더해졌다
                -추가 기능- 
                - let, const를 사용하는 변수 선언
                - 화살표 함수
                - Class 구문
                - 분할 대입
                - 템플릿 문자열
                - 스프레드 구문
                - Promise
                - 기타
        */}
    </div>
  )
}

export default ECMAScript